# AimErrEmptyName Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..EnergyAnalysisUtilitiesDBFailures..::..AimErrEmptyName Property
BuiltInFailures..::..EnergyAnalysisUtilitiesDBFailures Class See Also
---
MassZone '%1' has empty name and id values which cannot be used as gbXML identifiers.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId AimErrEmptyName { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AimErrEmptyName As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ AimErrEmptyName {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..EnergyAnalysisUtilitiesDBFailures Class
Autodesk.Revit.DB Namespace